Revit 2027 API
Document.GetWarnings Method
 Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessage> GetWarnings()
Public Function GetWarnings As IList(Of FailureMessage)
public:
IList<FailureMessage^>^ GetWarnings()
member GetWarnings : unit -> IList<FailureMessage>
Return Value
IList<FailureMessage>
 List of failure messages representing warnings accumulated in the document.
Remarks
 Function returns list of failure messages identical to the list displayed in a warning dialog when command Manage tab->Inquiry pane->Review Warnings is issued through the UI. Operations performed on the returned list by the caller do not impact information about warnings stored in the document.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace